#  Pandas کار با کتابخانه

## قسمت سوم

In [1]:
import pandas as pd
import numpy as np

## Pandas - IO Tools

### Reading files

In [2]:
df=pd.read_csv("Datasets/temp.csv")
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [4]:
df=pd.read_csv("Datasets/temp.csv",index_col=['S.No'])
df

        Name  Age       City  Salary
S.No
1        Tom   28    Toronto   20000
2        Lee   32   HongKong    3000
3     Steven   43   Bay Area    8300
4        Ram   38  Hyderabad    3900

In [5]:
df=pd.read_csv("Datasets/temp.csv", dtype={'Salary': np.float64})
df

   S.No    Name  Age       City   Salary
0     1     Tom   28    Toronto  20000.0
1     2     Lee   32   HongKong   3000.0
2     3  Steven   43   Bay Area   8300.0
3     4     Ram   38  Hyderabad   3900.0

In [6]:
df=pd.read_csv("Datasets/temp.csv", names=['a', 'b', 'c','d','e'])
df

      a       b    c          d       e
0  S.No    Name  Age       City  Salary
1     1     Tom   28    Toronto   20000
2     2     Lee   32   HongKong    3000
3     3  Steven   43   Bay Area    8300
4     4     Ram   38  Hyderabad    3900

In [7]:
df=pd.read_csv("Datasets/temp.csv", names=['a', 'b', 'c','d','e'],header=0)
df

   a       b   c          d      e
0  1     Tom  28    Toronto  20000
1  2     Lee  32   HongKong   3000
2  3  Steven  43   Bay Area   8300
3  4     Ram  38  Hyderabad   3900

In [8]:
df=pd.read_csv("Datasets/temp.csv", skiprows=2)
df

   2     Lee  32   HongKong  3000
0  3  Steven  43   Bay Area  8300
1  4     Ram  38  Hyderabad  3900

In [9]:
df=pd.read_excel("Datasets/temp.xlsx")
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [10]:
df2=pd.read_excel("Datasets/temp_per.xlsx")
df2

     نام نام خانوادگی  ورودی   معدل
0    علی        احمدی    911  15.64
1   حسین        روستا    921  14.43
2  فاطمه       رمضانی    931  16.00

In [13]:
df2=pd.read_csv("Datasets/temp_per.txt",sep='\t')
df2

     نام نام خانوادگی  ورودی   معدل
0    علی        احمدی    911  15.64
1   حسین        روستا    921  14.43
2  فاطمه       رمضانی    931  16.00

### Writing files

In [15]:
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [17]:
df.to_csv('Datasets/temp1.csv',index=False)

In [19]:
df2

     نام نام خانوادگی  ورودی   معدل
0    علی        احمدی    911  15.64
1   حسین        روستا    921  14.43
2  فاطمه       رمضانی    931  16.00

In [20]:
df2.to_csv('Datasets/temp1_per.csv',index=False)

In [22]:
df2.to_csv('Datasets/temp1_per.txt',index=False,sep='\t')

In [31]:
df2.to_excel('Datasets/temp1_per.xlsx',index=False)

## Pandas - Working with Text Data

In [25]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])
s

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [15]:
s.str.lower()

0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object

In [16]:
s.str.upper()

0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object

In [17]:
s.str.len()

0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [28]:
s.str.split(' ')

0              [Tom]
1    [William, Rick]
2             [John]
3          [Alber@t]
4                NaN
5             [1234]
6       [SteveSmith]
dtype: object

In [30]:
s.str.split('')

0                               [, T, o, m, ]
1    [, W, i, l, l, i, a, m,  , R, i, c, k, ]
2                            [, J, o, h, n, ]
3                   [, A, l, b, e, r, @, t, ]
4                                         NaN
5                            [, 1, 2, 3, 4, ]
6          [, S, t, e, v, e, S, m, i, t, h, ]
dtype: object

In [32]:
s.str.cat(sep='_')

'Tom_William Rick_John_Alber@t_1234_SteveSmith'

In [35]:
s.str.contains(' ')

0    False
1     True
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [36]:
s.str.replace('@','$')

0             Tom
1    William Rick
2            John
3         Alber$t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [39]:
s.str.count('m')

0    1.0
1    1.0
2    0.0
3    0.0
4    NaN
5    0.0
6    1.0
dtype: float64

In [41]:
s.str. startswith ('T')

0     True
1    False
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [43]:
s.str.endswith('t')

0    False
1    False
2    False
3     True
4      NaN
5    False
6    False
dtype: object

In [46]:
 s.str.find('e')
#"-1" indicates that there no such pattern available in the element.

0   -1.0
1   -1.0
2   -1.0
3    3.0
4    NaN
5   -1.0
6    2.0
dtype: float64

In [47]:
s.str.findall('e')

0        []
1        []
2        []
3       [e]
4       NaN
5        []
6    [e, e]
dtype: object